export default function (code) {
  const codeWithStr = {
    298: '[298] 用户名或密码错误',
    401: '[401] 未授权',
    440: '[440] 登录超时',
    297: '[297] 验证码错误',
    296: '[296] 用户已经存在',
    299: '[299] 表单校验错误',
    500: '[500] 服务器内部错误',
    404: '[404] 不存在',
    400: '[400] 请求有误',
    403: '[403] 没有权限',
    201: '[201] 已创建',
    501: '[501] 未实现',
    502: '[502] 网关错误',
    503: '[503] 服务不可用',
    504: '[504] 请求超时',
    413: '[413] 请求过大',
    425: '[425] 太早了',
    200: '[200] 好',
    100: '[100] 继续',
  }

  if (!(code in codeWithStr)) {
    return `[${code}] 未知错误`
  }
  return codeWithStr[code]
}
